nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt595/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN_MASK (1U << 17U)          /*!<@brief GPIO pin mask */
#define BOARD_LED_BLUE_PORT 3U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_BLUE_PIN 17U                            /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK (1U << 17U)               /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord H16), J45[22]/U9[13]/U105[4]
  @{ */
/* Routed pin properties */
#define BOARD_DEBUG_UART_RX_PERIPHERAL FLEXCOMM0           /*!<@brief Peripheral name */
#define BOARD_DEBUG_UART_RX_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
                                                           /* @} */

/*! @name FC0_TXD_SCL_MISO_WS (coord G16), J45[32]/U105[3]/U9[12]
  @{ */
/* Routed pin properties */
#define BOARD_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0           /*!<@brief Peripheral name */
#define BOARD_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS         /*!<@brief Signal name */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SWCLK (coord M2), U7[4]
  @{ */
/* Routed pin properties */
#define BOARD_SWDCLK_PERIPHERAL SWD /*!<@brief Peripheral name */
#define BOARD_SWDCLK_SIGNAL SWCLK   /*!<@brief Signal name */
                                    /* @} */

/*! @name SWDIO (coord M4), J19[2]/J2[2]/SWDIO
  @{ */
/* Routed pin properties */
#define BOARD_SWDIO_PERIPHERAL SWD             /*!<@brief Peripheral name */
#define BOARD_SWDIO_SIGNAL SWDIO               /*!<@brief Signal name */
                                               /* @} */

/*! @name SWO (coord N3), U7[12]
  @{ */
/* Routed pin properties */
#define BOARD_SWO_PERIPHERAL SWD /*!<@brief Peripheral name */
#define BOARD_SWO_SIGNAL SWO     /*!<@brief Signal name */
                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC2 0x02u            /*!<@brief Selects pin function 2 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI1_SCLK (coord H2), U108[B2]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_CLK_PERIPHERAL FLEXSPI1    /*!<@brief Peripheral name */
#define BOARD_PSRAM_CLK_SIGNAL FLEXSPI_SCLK    /*!<@brief Signal name */
                                               /* @} */

/*! @name FLEXSPI1_DATA1 (coord G2), U108[D2]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ1_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ1_SIGNAL FLEXSPI_DATA1    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DATA0 (coord H1), U108[D3]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ0_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ0_SIGNAL FLEXSPI_DATA0    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DATA2 (coord F1), U108[C4]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ2_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ2_SIGNAL FLEXSPI_DATA2    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DATA3 (coord K3), U108[D4]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ3_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ3_SIGNAL FLEXSPI_DATA3    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DQS (coord H3), U108[C3]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_DQS_PERIPHERAL FLEXSPI1   /*!<@brief Peripheral name */
#define BOARD_PSRAM_DQS_SIGNAL FLEXSPI_DQS    /*!<@brief Signal name */
                                              /* @} */

/*! @name FLEXSPI1_SS0_N (coord E13), U108[A3]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_CE_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_CE_SIGNAL FLEXSPI_SS0_N    /*!<@brief Signal name */
                                               /* @} */

