nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt595/common/pin_mux/pin_mux.h
/*! @name FLEXSPI1_DATA4 (coord H5), U108[D5]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ4_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ4_SIGNAL FLEXSPI_DATA4    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DATA5 (coord H4), U108[E3]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ5_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ5_SIGNAL FLEXSPI_DATA5    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DATA6 (coord J3), U108[E2]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ6_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ6_SIGNAL FLEXSPI_DATA6    /*!<@brief Signal name */
                                                 /* @} */

/*! @name FLEXSPI1_DATA7 (coord J4), U108[E1]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_ADQ7_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_PSRAM_ADQ7_SIGNAL FLEXSPI_DATA7    /*!<@brief Signal name */
                                                 /* @} */

/*! @name PIO0_28 (coord A12), U108[A4]
  @{ */
/* Routed pin properties */
#define BOARD_PSRAM_RESET_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_PSRAM_RESET_SIGNAL PIO0                        /*!<@brief Signal name */
#define BOARD_PSRAM_RESET_CHANNEL 28                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_PSRAM_RESET_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_PSRAM_RESET_GPIO_PIN_MASK (1U << 28U)          /*!<@brief GPIO pin mask */
#define BOARD_PSRAM_RESET_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_PSRAM_RESET_PIN 28U                            /*!<@brief PORT pin number */
#define BOARD_PSRAM_RESET_PIN_MASK (1U << 28U)               /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPSRAMPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SD0_CARD_DET_N (coord T3), J32[10]/SD0_CARD_DET_N
  @{ */
/* Routed pin properties */
#define BOARD_SD0_CARD_DET_N_PERIPHERAL USDHC0              /*!<@brief Peripheral name */
#define BOARD_SD0_CARD_DET_N_SIGNAL USDHC_CARD_DET          /*!<@brief Signal name */
                                                            /* @} */

/*! @name SD0_CLK (coord R5), U111A[M6]/SD0_CLK
  @{ */
/* Routed pin properties */
#define BOARD_SD0_CLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_SD0_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
                                                /* @} */

/*! @name SD0_CMD (coord R6), U111A[M5]/SD0_CMD
  @{ */
/* Routed pin properties */
#define BOARD_SD0_CMD_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_SD0_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
                                                /* @} */

/*! @name SD0_D0 (coord U4), U111A[A3]/SD0_D0
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D0_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D0_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D0_CHANNEL 0                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D1 (coord T4), U111A[A4]/SD0_D1
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D1_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D1_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D1_CHANNEL 1                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D2 (coord T7), U111A[A5]/SD0_D2
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D2_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D2_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D2_CHANNEL 2                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D3 (coord U6), U111A[B2]/SD0_D3
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D3_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D3_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D3_CHANNEL 3                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D4 (coord P5), U111A[B3]/SD0_D4
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D4_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D4_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D4_CHANNEL 4                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D5 (coord R4), U111A[B4]/SD0_D5
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D5_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D5_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D5_CHANNEL 5                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D6 (coord P4), U111A[B5]/SD0_D6
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D6_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D6_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D6_CHANNEL 6                /*!<@brief Signal channel */
                                              /* @} */

/*! @name SD0_D7 (coord T6), U111A[B6]/SD0_D7
  @{ */
/* Routed pin properties */
#define BOARD_SD0_D7_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_SD0_D7_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_SD0_D7_CHANNEL 7                /*!<@brief Signal channel */
                                              /* @} */

/*! @name PIO2_10 (coord N5), SD0_RESET_N
  @{ */
/* Routed pin properties */
#define BOARD_SD0_RESET_N_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_SD0_RESET_N_SIGNAL PIO2                        /*!<@brief Signal name */
#define BOARD_SD0_RESET_N_CHANNEL 10                         /*!<@brief Signal channel */

