nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt595/common/pin_mux/pin_mux.h
/*! @name PDM_CLK01 (coord P2), J31[3]/J31[5]/J31[7]/J31[9]
  @{ */
/* Routed pin properties */
#define BOARD_DMIC_PDM_CLK01_PERIPHERAL DMIC0                    /*!<@brief Peripheral name */
#define BOARD_DMIC_PDM_CLK01_SIGNAL CLK                          /*!<@brief Signal name */
#define BOARD_DMIC_PDM_CLK01_CHANNEL 01                          /*!<@brief Signal channel */
                                                                 /* @} */

/*! @name PDM_DATA01 (coord P3), J31[4]
  @{ */
/* Routed pin properties */
#define BOARD_DMIC_PDM_DAT01_PERIPHERAL DMIC0      /*!<@brief Peripheral name */
#define BOARD_DMIC_PDM_DAT01_SIGNAL DATA           /*!<@brief Signal name */
#define BOARD_DMIC_PDM_DAT01_CHANNEL 01            /*!<@brief Signal channel */
                                                   /* @} */

/*! @name PDM_DATA23 (coord D16), J31[6]
  @{ */
/* Routed pin properties */
#define BOARD_DMIC_PDM_DAT23_PERIPHERAL DMIC0      /*!<@brief Peripheral name */
#define BOARD_DMIC_PDM_DAT23_SIGNAL DATA           /*!<@brief Signal name */
#define BOARD_DMIC_PDM_DAT23_CHANNEL 23            /*!<@brief Signal channel */
                                                   /* @} */

/*! @name PDM_DATA45 (coord C16), J31[8]
  @{ */
/* Routed pin properties */
#define BOARD_DMIC_PDM_DAT45_PERIPHERAL DMIC0      /*!<@brief Peripheral name */
#define BOARD_DMIC_PDM_DAT45_SIGNAL DATA           /*!<@brief Signal name */
#define BOARD_DMIC_PDM_DAT45_CHANNEL 45            /*!<@brief Signal channel */
                                                   /* @} */

/*! @name PDM_DATA67 (coord D15), J31[10]
  @{ */
/* Routed pin properties */
#define BOARD_DMIC_PDM_DAT67_PERIPHERAL DMIC0      /*!<@brief Peripheral name */
#define BOARD_DMIC_PDM_DAT67_SIGNAL DATA           /*!<@brief Signal name */
#define BOARD_DMIC_PDM_DAT67_CHANNEL 67            /*!<@brief Signal channel */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDMICPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC4_RXD_SDA_MOSI_DATA (coord D14), J45[58]/I2C_SDA/U6[6]/ACC_I2C_SDA
  @{ */
/* Routed pin properties */
#define BOARD_ACC_I2C_SDA_PERIPHERAL FLEXCOMM4                      /*!<@brief Peripheral name */
#define BOARD_ACC_I2C_SDA_SIGNAL RXD_SDA_MOSI_DATA                  /*!<@brief Signal name */
                                                                    /* @} */

/*! @name FC4_TXD_SCL_MISO_WS (coord B11), J45[60]/I2C_SCL/U6[4]/ACC_I2C_SCL
  @{ */
/* Routed pin properties */
#define BOARD_ACC_I2C_SCL_PERIPHERAL FLEXCOMM4                      /*!<@brief Peripheral name */
#define BOARD_ACC_I2C_SCL_SIGNAL TXD_SCL_MISO_WS                    /*!<@brief Signal name */
                                                                    /* @} */

/*! @name PIO0_22 (coord B14), J19[14]/U6[11]/ACC_INT
  @{ */
/* Routed pin properties */
#define BOARD_ACC_INT_PERIPHERAL GPIO                   /*!<@brief Peripheral name */
#define BOARD_ACC_INT_SIGNAL PIO0                       /*!<@brief Signal name */
#define BOARD_ACC_INT_CHANNEL 22                        /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_ACC_INT_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACC_INT_GPIO_PIN_MASK (1U << 22U)         /*!<@brief GPIO pin mask */
#define BOARD_ACC_INT_PORT 0U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_ACC_INT_PIN 22U                           /*!<@brief PORT pin number */
#define BOARD_ACC_INT_PIN_MASK (1U << 22U)              /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_7 (coord M1), U6[16]/ACC_RESET
  @{ */
/* Routed pin properties */
#define BOARD_ACC_RESET_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_ACC_RESET_SIGNAL PIO1                        /*!<@brief Signal name */
#define BOARD_ACC_RESET_CHANNEL 7                          /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_ACC_RESET_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACC_RESET_GPIO_PIN_MASK (1U << 7U)           /*!<@brief GPIO pin mask */
#define BOARD_ACC_RESET_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_ACC_RESET_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_ACC_RESET_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO3_21 (coord E5), J44[21]/LCM_RESET_B
  @{ */
/* Routed pin properties */
#define BOARD_LCM_RESET_B_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_LCM_RESET_B_SIGNAL PIO3                        /*!<@brief Signal name */
#define BOARD_LCM_RESET_B_CHANNEL 21                         /*!<@brief Signal channel */

