nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt595/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LCM_RESET_B_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCM_RESET_B_GPIO_PIN_MASK (1U << 21U)          /*!<@brief GPIO pin mask */
#define BOARD_LCM_RESET_B_PORT 3U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_LCM_RESET_B_PIN 21U                            /*!<@brief PORT pin number */
#define BOARD_LCM_RESET_B_PIN_MASK (1U << 21U)               /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO3_15 (coord E10), U44[4]/LCM_PWR_EN
  @{ */
/* Routed pin properties */
#define BOARD_LCM_PWR_EN_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_LCM_PWR_EN_SIGNAL PIO3                        /*!<@brief Signal name */
#define BOARD_LCM_PWR_EN_CHANNEL 15                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LCM_PWR_EN_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCM_PWR_EN_GPIO_PIN_MASK (1U << 15U)          /*!<@brief GPIO pin mask */
#define BOARD_LCM_PWR_EN_PORT 3U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_LCM_PWR_EN_PIN 15U                            /*!<@brief PORT pin number */
#define BOARD_LCM_PWR_EN_PIN_MASK (1U << 15U)               /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_12 (coord E14), U44[5]/LCM_BL_PWM_1V8
  @{ */
/* Routed pin properties */
#define BOARD_LCM_BL_PWM_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_LCM_BL_PWM_SIGNAL PIO0                        /*!<@brief Signal name */
#define BOARD_LCM_BL_PWM_CHANNEL 12                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LCM_BL_PWM_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_LCM_BL_PWM_GPIO_PIN_MASK (1U << 12U)          /*!<@brief GPIO pin mask */
#define BOARD_LCM_BL_PWM_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_LCM_BL_PWM_PIN 12U                            /*!<@brief PORT pin number */
#define BOARD_LCM_BL_PWM_PIN_MASK (1U << 12U)               /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name MIPI_DSI_CLKN (coord D1), J44[11]
  @{ */
/* Routed pin properties */
#define BOARD_MIPI_TCN_PERIPHERAL MIPI_DSI_HOST /*!<@brief Peripheral name */
#define BOARD_MIPI_TCN_SIGNAL CLKN              /*!<@brief Signal name */
                                                /* @} */

/*! @name MIPI_DSI_CLKP (coord D2), J44[12]
  @{ */
/* Routed pin properties */
#define BOARD_MIPI_TCP_PERIPHERAL MIPI_DSI_HOST /*!<@brief Peripheral name */
#define BOARD_MIPI_TCP_SIGNAL CLKP              /*!<@brief Signal name */
                                                /* @} */

/*! @name MIPI_DSI_D0N (coord C2), J44[5]
  @{ */
/* Routed pin properties */
#define BOARD_MIPI_TDN0_PERIPHERAL MIPI_DSI_HOST /*!<@brief Peripheral name */
#define BOARD_MIPI_TDN0_SIGNAL DN                /*!<@brief Signal name */
#define BOARD_MIPI_TDN0_CHANNEL 0                /*!<@brief Signal channel */
                                                 /* @} */

/*! @name MIPI_DSI_D1N (coord F3), J44[8]
  @{ */
/* Routed pin properties */
#define BOARD_MIPI_TDN1_PERIPHERAL MIPI_DSI_HOST /*!<@brief Peripheral name */
#define BOARD_MIPI_TDN1_SIGNAL DN                /*!<@brief Signal name */
#define BOARD_MIPI_TDN1_CHANNEL 1                /*!<@brief Signal channel */
                                                 /* @} */

/*! @name MIPI_DSI_D0P (coord B1), J44[6]
  @{ */
/* Routed pin properties */
#define BOARD_MIPI_TDP0_PERIPHERAL MIPI_DSI_HOST /*!<@brief Peripheral name */
#define BOARD_MIPI_TDP0_SIGNAL DP                /*!<@brief Signal name */
#define BOARD_MIPI_TDP0_CHANNEL 0                /*!<@brief Signal channel */
                                                 /* @} */

/*! @name MIPI_DSI_D1P (coord E3), J44[9]
  @{ */
/* Routed pin properties */
#define BOARD_MIPI_TDP1_PERIPHERAL MIPI_DSI_HOST /*!<@brief Peripheral name */
#define BOARD_MIPI_TDP1_SIGNAL DP                /*!<@brief Signal name */
#define BOARD_MIPI_TDP1_CHANNEL 1                /*!<@brief Signal channel */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMIPI_DSIPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
